Hi again @RobVK-MP 👋 I'm not able to reproduce this issue given recent versions of Terraform CLI. There's a good chance there was previously a bug that was fixed with `create_before_destroy` behavior in between then and now.

Here's a working configuration, that allows you to modify the target group without issue:

```hcl
terraform {
  required_providers {
    aws = "2.34.0"
  }

  required_version = "0.12.13"
}

provider "aws" {
  region = "us-east-2"
}

data "aws_availability_zones" "available" {
  state = "available"
}

resource "aws_vpc" "test" {
  cidr_block = "10.0.0.0/16"
}

resource "aws_subnet" "test" {
  count = 2

  availability_zone = data.aws_availability_zones.available.names[count.index]
  cidr_block        = "10.0.${count.index}.0/24"
  vpc_id            = aws_vpc.test.id
}

resource "aws_lb" "test" {
  internal           = true
  load_balancer_type = "application"
  name               = "bflad-testing"
  subnets            = aws_subnet.test[*].id
}

resource "aws_lb_listener" "test" {
  port              = "80"
  protocol          = "HTTP"
  load_balancer_arn = aws_lb.test.arn

  default_action {
    target_group_arn = aws_lb_target_group.test.arn
    type             = "forward"
  }
}

resource "aws_lb_listener_rule" "test" {
  listener_arn = aws_lb_listener.test.arn

  action {
    type = "forward"
    target_group_arn = aws_lb_target_group.test.arn
  }

  condition {
    field = "host-header"
    values = ["test.com"]
  }
}

resource "aws_lb_target_group" "test" {
  name_prefix = "test"
  port        = 80
  protocol    = "HTTP"
  vpc_id      = aws_vpc.test.id

  lifecycle {
    create_before_destroy = true
  }
}
```

```console
$ terraform apply
data.aws_availability_zones.available: Refreshing state...
aws_vpc.test: Refreshing state... [id=vpc-047dfc104115c9f39]
aws_subnet.test[1]: Refreshing state... [id=subnet-01a79dd662ef9fea4]
aws_subnet.test[0]: Refreshing state... [id=subnet-065cd019fdc0ee897]
aws_lb_target_group.test: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:--OMITTED--:targetgroup/bflad-testing/48c38bfe75a8225e]
aws_lb.test: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:--OMITTED--:loadbalancer/app/bflad-testing/06dd1f9dcb7787f6]
aws_lb_listener.test: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:--OMITTED--:listener/app/bflad-testing/06dd1f9dcb7787f6/3c9e1a8fefb00738]
aws_lb_listener_rule.test: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:--OMITTED--:listener-rule/app/bflad-testing/06dd1f9dcb7787f6/3c9e1a8fefb00738/c6d716523e21ca35]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_lb_listener.test will be updated in-place
  ~ resource "aws_lb_listener" "test" {
        arn               = "arn:aws:elasticloadbalancing:us-east-2:--OMITTED--:listener/app/bflad-testing/06dd1f9dcb7787f6/3c9e1a8fefb00738"
        id                = "arn:aws:elasticloadbalancing:us-east-2:--OMITTED--:listener/app/bflad-testing/06dd1f9dcb7787f6/3c9e1a8fefb00738"
        load_balancer_arn = "arn:aws:elasticloadbalancing:us-east-2:--OMITTED--:loadbalancer/app/bflad-testing/06dd1f9dcb7787f6"
        port              = 80
        protocol          = "HTTP"

      ~ default_action {
            order            = 1
          ~ target_group_arn = "arn:aws:elasticloadbalancing:us-east-2:--OMITTED--:targetgroup/bflad-testing/48c38bfe75a8225e" -> (known after apply)
            type             = "forward"
        }
    }

  # aws_lb_listener_rule.test will be updated in-place
  ~ resource "aws_lb_listener_rule" "test" {
        arn          = "arn:aws:elasticloadbalancing:us-east-2:--OMITTED--:listener-rule/app/bflad-testing/06dd1f9dcb7787f6/3c9e1a8fefb00738/c6d716523e21ca35"
        id           = "arn:aws:elasticloadbalancing:us-east-2:--OMITTED--:listener-rule/app/bflad-testing/06dd1f9dcb7787f6/3c9e1a8fefb00738/c6d716523e21ca35"
        listener_arn = "arn:aws:elasticloadbalancing:us-east-2:--OMITTED--:listener/app/bflad-testing/06dd1f9dcb7787f6/3c9e1a8fefb00738"
        priority     = 1

      ~ action {
            order            = 1
          ~ target_group_arn = "arn:aws:elasticloadbalancing:us-east-2:--OMITTED--:targetgroup/bflad-testing/48c38bfe75a8225e" -> (known after apply)
            type             = "forward"
        }

        condition {
            field  = "host-header"
            values = [
                "test.com",
            ]
        }
    }

  # aws_lb_target_group.test must be replaced
+/- resource "aws_lb_target_group" "test" {
      ~ arn                                = "arn:aws:elasticloadbalancing:us-east-2:--OMITTED--:targetgroup/bflad-testing/48c38bfe75a8225e" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/bflad-testing/48c38bfe75a8225e" -> (known after apply)
        deregistration_delay               = 300
      ~ id                                 = "arn:aws:elasticloadbalancing:us-east-2:--OMITTED--:targetgroup/bflad-testing/48c38bfe75a8225e" -> (known after apply)
        lambda_multi_value_headers_enabled = false
      ~ name                               = "bflad-testing" -> (known after apply)
      + name_prefix                        = "test" # forces replacement
      ~ port                               = 8080 -> 80 # forces replacement
        protocol                           = "HTTP"
        proxy_protocol_v2                  = false
        slow_start                         = 0
      - tags                               = {} -> null
        target_type                        = "instance"
        vpc_id                             = "vpc-047dfc104115c9f39"

      ~ health_check {
          ~ enabled             = true -> (known after apply)
          ~ healthy_threshold   = 5 -> (known after apply)
          ~ interval            = 30 -> (known after apply)
          ~ matcher             = "200" -> (known after apply)
          ~ path                = "/" -> (known after apply)
          ~ port                = "traffic-port" -> (known after apply)
          ~ protocol            = "HTTP" -> (known after apply)
          ~ timeout             = 5 -> (known after apply)
          ~ unhealthy_threshold = 2 -> (known after apply)
        }

      ~ stickiness {
          ~ cookie_duration = 86400 -> (known after apply)
          ~ enabled         = false -> (known after apply)
          ~ type            = "lb_cookie" -> (known after apply)
        }
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_lb_target_group.test: Creating...
aws_lb_target_group.test: Creation complete after 0s [id=arn:aws:elasticloadbalancing:us-east-2:--OMITTED--:targetgroup/test20191105031709585200000001/c6c3212acb4f5877]
aws_lb_listener.test: Modifying... [id=arn:aws:elasticloadbalancing:us-east-2:--OMITTED--:listener/app/bflad-testing/06dd1f9dcb7787f6/3c9e1a8fefb00738]
aws_lb_listener.test: Modifications complete after 1s [id=arn:aws:elasticloadbalancing:us-east-2:--OMITTED--:listener/app/bflad-testing/06dd1f9dcb7787f6/3c9e1a8fefb00738]
aws_lb_listener_rule.test: Modifying... [id=arn:aws:elasticloadbalancing:us-east-2:--OMITTED--:listener-rule/app/bflad-testing/06dd1f9dcb7787f6/3c9e1a8fefb00738/c6d716523e21ca35]
aws_lb_listener_rule.test: Modifications complete after 0s [id=arn:aws:elasticloadbalancing:us-east-2:--OMITTED--:listener-rule/app/bflad-testing/06dd1f9dcb7787f6/3c9e1a8fefb00738/c6d716523e21ca35]
aws_lb_target_group.test: Destroying... [id=arn:aws:elasticloadbalancing:us-east-2:--OMITTED--:targetgroup/bflad-testing/48c38bfe75a8225e]
aws_lb_target_group.test: Destruction complete after 0s

Apply complete! Resources: 1 added, 2 changed, 1 destroyed.
```

If you are still running into trouble, please submit a fresh bug report following the template and we'll be happy to take another look. 👍 